import { useState } from 'react';
import Navbar from '../../components/modules/Navbar'
import Sidebar from '../../components/modules/Sidebar'
import Title from '../../components/modules/Title'
import Table from '../../components/modules/Table';
import Paginations from '../../components/modules/Pagination';
import ComplaintsModal from '../../components/templates/Complaints/ComplaintsModal';

export default function index() {

  // data table
  let columnNames = ['شماره شکایت', 'نام و نام خانوادگی', 'تاریخ', 'شماره تماس', 'موضوع', 'عنوان شکایت'];

  let data = [
      { id: 1, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 2, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 3, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 4, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 5, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 6, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 7, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 8, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 9, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 10, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 11, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 12, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
      { id: 13, complaintNumber: '۳۲۳۵', name: 'نرگس یوسفی', date: '۲۳:۲۳ ۱۴۰۰/۰۹/۰۹', phoneNumber: '۰۹۳۹۰۰۹۳۴۹۴', subject: 'مالی', complaintTitle: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم', description: "برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و  متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشتکه تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی قرار گیرد." },
  ];

  //search
  const [searchTerm, setSearchTerm] = useState('');
  const filteredData = data.filter((item) =>
  Object.values(item).some((value) =>
  value.toString().toLowerCase().includes(searchTerm.toLowerCase())
  )
  );
  
  
  // pagination
  const [currentPage, setCurrentPage] = useState(1);
  const perPage = 10;
  
  const indexOfLastItem = currentPage * perPage;
  const indexOfFirstItem = indexOfLastItem - perPage;
  const currentData = filteredData.slice(indexOfFirstItem, indexOfLastItem);

  const paginate = (pageNumber) => setCurrentPage(pageNumber);


  //modal
  const [isComplaintsModalOpen, setIsComplaintsModalOpen] = useState(false);
  const [consultantsData, setConsultantsData] = useState();

  const toggleComplaintsModal = (data) => {
    setIsComplaintsModalOpen(!isComplaintsModalOpen);
    setConsultantsData(data);
  };

  return (
    <>
    <Navbar/>
    <Sidebar/>
    <div className="xl:mr-[240px] px-6 xl:py-7 py-4">
    <Title title='شکایات'/>
    <div className="my-6">
    <Table
      title='لیست شکایت ها'
      columnNames={columnNames}
      currentData={currentData}
      searchTerm={searchTerm}
      setSearchTerm={setSearchTerm}
      toggleComplaintsModal={toggleComplaintsModal}
      />
    </div>
    <Paginations perPage={perPage} total={filteredData.length} paginate={paginate} />
    </div>

    <ComplaintsModal isComplaintsModalOpen={isComplaintsModalOpen} consultantsData={consultantsData}
      toggleComplaintsModal={toggleComplaintsModal}/>
    </>
  )
}